Autodesk.Revit.DB.Visual.Stone.CommonTintColor
The property labeled "Tint Color" from the "Stone" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
Since:
2018.1

Autodesk.Revit.DB.Visual.Stone.CommonTintToggle
The property labeled "Tint" from the "Stone" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Stone.StonePatternAmount
The property labeled "Amount" from the "Stone" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 2".
Since:
2018.1

Autodesk.Revit.DB.Visual.Stone.StonePatternMap
The property labeled "Image" from the "Stone" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.Stone.StonePattern
The property labeled "Relief Pattern" from the "Stone" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "StonePatternType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Stone.StoneBumpAmount
The property labeled "Amount" from the "Stone" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.Stone.StoneBumpMap
The property labeled "Image" from the "Stone" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.Stone.StoneBump
The property labeled "Type" from the "Stone" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "StoneBumpType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Stone.StoneApplication
The property labeled "Finish" from the "Stone" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "StoneApplicationType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Stone.StoneColor
The property labeled "Image" from the "Stone" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Stone
Represents the properties of materials.
Since:
2018.1